In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [14]:
index = [1, 2, 3]
names = ['Razan', 'Mohammed', 'Ahmed']
s2 = pd.Series(names, index=index)
s2

1       Razan
2    Mohammed
3       Ahmed
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [15]:
s2.index = [11, 12, 13]
s2

11       Razan
12    Mohammed
13       Ahmed
dtype: object

## Q3: Retrieve First and second elements.

In [16]:
print(s2[11])
print(s2[12])

Razan
Mohammed

## Q4: Add duplicate elements, then remove the duplication

In [17]:
s3 = pd.Series({14:'Razan'})
s2=s2.append(s3)
s2

/var/folders/08/58mz7f7n2ps7fm984_8_7slc0000gn/T/ipykernel_22683/1417148237.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s2=s2.append(s3)

11       Razan
12    Mohammed
13       Ahmed
14       Razan
dtype: object

In [19]:
s2=s2.drop_duplicates()
s2

11       Razan
12    Mohammed
13       Ahmed
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name)

In [21]:
data = {
        'ID': [11,12,13,14,15],
        'Name': ['Razan', 'Lolo', 'Norah', 'Mohammed', 'Ahmad'],
       }

SalesDF = pd.DataFrame(data, columns=[ 'ID', 'Name'])
SalesDF

   ID      Name
0  11     Razan
1  12      Lolo
2  13     Norah
3  14  Mohammed
4  15     Ahmad

## Q6: Read educ_figdp_1_Data.csv file

In [23]:
ed = pd.read_csv('educ_figdp_1_Data.csv')
ed

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: What is the difference between loc and slicing?
- loc use the index labels as references
- slice use the position as references

In [24]:
edu.loc[:2,:] #loc include the end row

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e

In [26]:
edu[:2]  #slicing not include the end row

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN